zephyrproject-rtos/hal_infineon/mtb-pdl-cat1/devices/COMPONENT_CAT1A/include/cy8c6144fmi_s4f73.h
/*******************************************************************************
*                                     CTBM
*******************************************************************************/

#define CTBM0_BASE                              0x40900000UL
#define CTBM0                                   ((CTBM_Type*) CTBM0_BASE)                                         /* 0x40900000 */

/*******************************************************************************
*                                    CTDAC
*******************************************************************************/

#define CTDAC0_BASE                             0x40940000UL
#define CTDAC0                                  ((CTDAC_Type*) CTDAC0_BASE)                                       /* 0x40940000 */

/*******************************************************************************
*                                     SAR
*******************************************************************************/

#define SAR0_BASE                               0x409B0000UL
#define SAR0                                    ((SAR_Type*) SAR0_BASE)                                           /* 0x409B0000 */

/*******************************************************************************
*                                     PASS
*******************************************************************************/

#define PASS_BASE                               0x409F0000UL
#define PASS                                    ((PASS_Type*) PASS_BASE)                                          /* 0x409F0000 */
#define PASS_TIMER                              ((PASS_TIMER_Type*) &PASS->TIMER)                                 /* 0x409F0100 */
#define PASS_LPOSC                              ((PASS_LPOSC_Type*) &PASS->LPOSC)                                 /* 0x409F0200 */
#define PASS_FIFO0                              ((PASS_FIFO_Type*) &PASS->FIFO[0])                                /* 0x409F0300 */
#define PASS_FIFO1                              ((PASS_FIFO_Type*) &PASS->FIFO[1])                                /* 0x409F0400 */
#define PASS_AREFV2                             ((PASS_AREFV2_Type*) &PASS->AREFV2)                               /* 0x409F0E00 */

/** \} CY8C6144FMI-S4F73 */

#endif /* _CY8C6144FMI_S4F73_H_ */


/* [] END OF FILE */
